-- MySQL dump 10.13  Distrib 8.0.16, for macos10.14 (x86_64)
--
-- Host: 127.0.0.1    Database: eyulingo_db
-- ------------------------------------------------------
-- Server version	8.0.15

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
 SET NAMES utf8 ;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `Goods`
--

DROP TABLE IF EXISTS `Goods`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `Goods` (
  `good_id` int(11) NOT NULL,
  `good_name` varchar(64) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `store_id` int(11) DEFAULT NULL,
  `price` decimal(8,2) DEFAULT NULL,
  `discount` decimal(8,2) DEFAULT NULL,
  `storage` int(11) DEFAULT NULL,
  `description` varchar(1024) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `good_image_id` varchar(128) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`good_id`),
  KEY `store_id` (`store_id`),
  CONSTRAINT `goods_ibfk_1` FOREIGN KEY (`store_id`) REFERENCES `stores` (`store_id`) ON DELETE RESTRICT
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Goods`
--

LOCK TABLES `Goods` WRITE;
/*!40000 ALTER TABLE `Goods` DISABLE KEYS */;
INSERT INTO `Goods` VALUES (1,'iPhone 8 Plus',1,4999.00,4988.00,15123,'迄今为止最先进的 iPhone。','5d1d6ab66344590007151479'),(2,'iPad Pro (12.9-inch)',1,6999.00,6599.00,23944,'最先进的生产力。','5d1d6ac1634459000715147b'),(3,'MacBook Pro (2019)',1,12999.00,11699.00,2534,'出类拔萃的专业笔记本电脑。','5d1d6acc634459000715147d'),(4,'Apple Watch (Series 4)',1,2699.00,2499.00,16039,'看看 Apple Watch 如何让你充满活力、保持健康，并时刻与人紧密连系，是你健康生活不可或缺的终极装置。','5d1d6ad9634459000715147f'),(5,'Surface Pro 6',2,5999.00,5499.00,4732,'Surface Pro 6 新款笔记本平板二合一。','5d1d6b3b6344590007151481'),(6,'Surface Book 2',2,7999.00,7299.00,4456,'全新微软 Surface Book 2 微软官方商城热卖。第8代英特尔处理器，可选NVIDIA独立显卡，17小时电池续航时间，性能巨匠微软Surface Book 2，四重模式任意变换。','5d1d6b476344590007151483'),(7,'Surface Studio 2',2,21999.00,19999.00,393,'Surface Studio 是微软推出的运行 64 位 Windows 10 的一体机产品。','5d1d6b506344590007151485'),(8,'Nokia Lumia 1520',2,4999.00,4499.00,49324,'诺基亚Lumia 1520 是 Nokia 公司设计和生产的一款平板手机。','5d1d6b596344590007151487'),(9,'芝士咖喱猪排饭',3,14.50,14.50,501,'芝士、咖喱和猪排，即食包装盒饭。','5d1d6bba6344590007151489'),(10,'滑蛋厚切猪排饭',3,13.00,13.00,254,'滑蛋、厚切猪排，即食包装盒饭。','5d1d6bd6634459000715148d'),(11,'爆浆猪排饭',3,16.50,16.50,321,'爆浆特大号猪排，即食包装盒饭。','5d1d6be0634459000715148f'),(12,'可口可乐（罐装）',3,3.00,3.00,152678,'300 毫升罐装冷藏可口可乐。','5d1d6bea6344590007151491'),(13,'奥尔良鸡排盖浇饭',4,17.50,17.50,234,'奥尔良鸡排和盖浇汤汁，即食包装盒饭。','5d1d6c2b6344590007151493'),(14,'大碗麻辣香锅饭',4,14.00,14.00,531,'特大碗麻辣香锅，即食包装盒饭。','5d1d6c356344590007151496'),(15,'沙茶牛肉双拼饭',4,15.50,14.00,153,'沙茶酱和牛肉的双拼搭配，即食包装盒饭。','5d1d6c416344590007151499'),(16,'百事可乐（罐装）',4,3.00,3.00,95865,'300 毫升罐装冷藏百事可乐。','5d1d6c51634459000715149b'),(17,'奶油虾仁意大利面',5,15.00,15.00,543,'奶油虾仁配意大利面，即食包装食品。','5d1d6e80634459000715149d'),(18,'咖喱鸡排饭团',5,7.00,7.00,135,'咖喱鸡排包裹米饭，即食包装食品。','5d1d6e8c634459000715149f'),(19,'超级海鲜披萨',5,18.00,18.00,421,'海鲜速冻披萨（1 片装）。','5d1d6ea363445900071514a1'),(20,'海鲜烩炒饭',5,16.50,16.50,43,'海鲜烩饭，即食包装盒饭。','5d1d6eb363445900071514a3'),(21,'麻婆豆腐烩饭',5,14.00,14.00,276,'麻婆豆腐烩饭，即食包装烩饭。','5d1d6ebe63445900071514a5'),(22,'炭烤风味鸡排便当',5,15.00,15.00,542,'炭烤风味鸡排米饭，即食包装食品。','5d1d6ecb63445900071514a7'),(23,'钢笔',6,5999.00,5999.00,152,'MONT BLANC 钢笔。','5d1d6f1b63445900071514a9'),(24,'手表',6,17999.00,17999.00,53,'MONT BLANC 手表。','5d1d6f2863445900071514ab'),(25,'墨水',6,1799.00,1799.00,5234,'MONT BLANC 墨水。','5d1d6f3463445900071514ae'),(26,'华为 P30 Pro 手机',7,5799.00,5799.00,4243,'地表最强拍照手机。','5d1d6fb263445900071514b0'),(27,'华为 MagicBook 2 笔记本电脑',7,8799.00,8499.00,6544,'华为 MagicBook 系列最新笔记本电脑。','5d1d6fbf63445900071514b4'),(28,'华为手环 3',7,1499.00,1399.00,3426,'华为手环系列最新款。','5d1d6fc963445900071514b6'),(29,'超能天然皂粉',8,59.00,54.00,42432,'超能天然皂粉去污牌洗衣粉。','5d1d703363445900071514b9'),(30,'立白洗衣粉',8,34.00,34.00,64365,'立白最新款去污洗衣粉。','5d1d703e63445900071514bb'),(31,'去渍霸超能去污洗衣粉',8,72.00,72.00,3147,'去渍霸，超能去污洗衣粉。','5d1d704663445900071514bd'),(32,'汰渍洗衣液',8,59.00,59.00,4328,'汰渍牌强效去污洗衣液。','5d1d705263445900071514bf'),(33,'蓝月亮护理洗衣液',8,49.00,49.00,8353,'蓝月亮不伤手护理洗衣液。','5d1d705e63445900071514c1'),(34,'魅族 16 手机',9,2799.00,2799.00,5341,'魅族「Sixteen」系列手机。','5d1d710363445900071514c3'),(35,'魅族 Note 6 手机',9,1499.00,1499.00,6241,'魅族大屏幕 Note 系列旗舰机。','5d1d711063445900071514c5'),(36,'魅族 16X 手机',9,3099.00,3099.00,7426,'魅族“16”系列手机最新款。','5d1d711a63445900071514c7'),(37,'茄子绒布玩具',10,15.00,15.00,47344,'茄子形状的绒布玩具，材质柔和，颜色亮丽。','5d1d715d63445900071514c9'),(38,'冰激凌球绒布玩具',10,9.00,9.00,87692,'冰激凌球形状的绒布玩具，材质柔和，颜色亮丽。','5d1d716863445900071514cb'),(39,'海盐洁面乳',10,97.00,97.00,1642,'包含真实海盐提取物的洁面乳。','5d1d717263445900071514cd'),(40,'SNICKERS 士力架巧克力',11,5.00,5.00,74124,'横扫饥饿的士力架巧克力条。','5d1d71f363445900071514cf'),(41,'苹果',11,3.00,3.00,6276,'普通的山东寿光苹果。','5d1d71fe63445900071514d1'),(42,'橙子',11,3.00,3.00,3784,'普通的甜橙。','5d1d720b63445900071514d3'),(43,'金扶宁（外用重组人粒细胞巨噬细胞刺激因子凝胶剂）',12,5999.00,5999.00,51,'主要成分为重组人粒细胞巨噬细胞刺激因子（rhGM-CSF），辅料为羧甲基纤维素钠、甘油及保护剂。','5d1d729c63445900071514d5'),(44,'美罗华（利妥昔单抗注射液）',12,3799.00,3799.00,57,'本品主要活性成分为重组利妥昔单抗。辅料包括枸橼酸钠，聚山梨醇酯，氯化钠和注射用水。','5d1d72a763445900071514d7'),(45,'舒莱（巴利息单抗注射液）',12,12499.00,12499.00,13,'本品活性成份为巴利昔单抗。每瓶含巴利昔单抗20毫克或10毫克，配5毫升注射用水1支。','5d1d72b263445900071514da'),(46,'拓益（特瑞普单抗注射液）',12,7399.00,7399.00,55,'每瓶含特瑞普利单抗240mg，通过DNA重组技术由中国仓鼠卵巢细胞制得。','5d1d72bf63445900071514dc'),(47,'Big Mac 巨无霸汉堡',13,45.00,45.00,312,'经典的 Big Mac 汉堡。','5d1d732b63445900071514de'),(48,'炸薯条',13,15.00,15.00,345,'油炸土豆条。','5d1d733a63445900071514e0'),(49,'McFlurry 麦旋风冰激凌',13,17.00,17.00,897,'啊，是 McFlurry 麦旋风！','5d1d734463445900071514e2'),(50,'双拼汉堡',13,16.00,16.00,434,'鸡肉和牛肉双拼汉堡。','5d1d734f63445900071514e4'),(51,'炸面包条',13,9.00,9.00,231,'美式炸干面包条。','5d1d735963445900071514e6');
/*!40000 ALTER TABLE `Goods` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-07-04 15:04:08
